In [386]:
import pandas as pd
import numpy as np

Siries это одномерный набор данных

In [387]:
l = [1, 3, 5, np.nan, 6, 8]
s = pd.Series(l)
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Информация о датафрейме

In [388]:
s.describe()

count    5.000000
mean     4.600000
std      2.701851
min      1.000000
25%      3.000000
50%      5.000000
75%      6.000000
max      8.000000
dtype: float64

Индексация

In [389]:
s[2]

5.0

In [390]:
s[2] = 7
s

0    1.0
1    3.0
2    7.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [391]:
s[2:5]

2    7.0
3    NaN
4    6.0
dtype: float64

In [392]:
s1 = s[1:]
s1

1    3.0
2    7.0
3    NaN
4    6.0
5    8.0
dtype: float64

Матан

In [393]:
s+s1

0     NaN
1     6.0
2    14.0
3     NaN
4    12.0
5    16.0
dtype: float64

In [394]:
np.exp(s)

0       2.718282
1      20.085537
2    1096.633158
3            NaN
4     403.428793
5    2980.957987
dtype: float64

Еще индексации

In [395]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [396]:
i = list("abcdef")
i

['a', 'b', 'c', 'd', 'e', 'f']

In [397]:
s = pd.Series(l, index=i)
s

a    1.0
b    3.0
c    5.0
d    NaN
e    6.0
f    8.0
dtype: float64

Теперь, когда индекс это строка к нему можно обращаться через точку

In [398]:
print(s['c'])
s.c

5.0

5.0

In [399]:
s = pd.Series({'a': 1, 'b': 3, 'c': 2})
s

a    1
b    3
c    2
dtype: int64

In [400]:
s.sort_values()

a    1
c    2
b    3
dtype: int64

Работа с датами

In [401]:
date_df = pd.date_range('20230101', periods=10)
date_df

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10'],
              dtype='datetime64[ns]', freq='D')

In [402]:
s = pd.Series(np.random.normal(size=10), index=date_df)
s

2023-01-01   -2.519419
2023-01-02   -0.666093
2023-01-03    1.688763
2023-01-04    0.857245
2023-01-05   -3.162546
2023-01-06   -1.217293
2023-01-07    0.176663
2023-01-08    0.734722
2023-01-09   -0.151815
2023-01-10   -0.463021
Freq: D, dtype: float64

In [403]:
s>0

2023-01-01    False
2023-01-02    False
2023-01-03     True
2023-01-04     True
2023-01-05    False
2023-01-06    False
2023-01-07     True
2023-01-08     True
2023-01-09    False
2023-01-10    False
Freq: D, dtype: bool

In [404]:
s[s>0]

2023-01-03    1.688763
2023-01-04    0.857245
2023-01-07    0.176663
2023-01-08    0.734722
dtype: float64

Датафреймы это двумерные таблицы

In [405]:
d = {'one': pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     'two': pd.Series([4, 5, 6, 7], index=['a', 'b', 'c', 'd'])
     }
df = pd.DataFrame(d)
df

   one  two
a  1.0    4
b  2.0    5
c  3.0    6
d  NaN    7

Индексация датафреймов

In [406]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [407]:
df.columns

Index(['one', 'two'], dtype='object')

In [408]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [409]:
df.two

a    4
b    5
c    6
d    7
Name: two, dtype: int64

In [410]:
df['one']['c']

3.0

In [411]:
df['b':'d']

   one  two
b  2.0    5
c  3.0    6
d  NaN    7

In [412]:
df[1:3]

   one  two
b  2.0    5
c  3.0    6

loc - первая позиция индекс строки, вторая - столбец

In [413]:
df.loc['b']

one    2.0
two    5.0
Name: b, dtype: float64

In [414]:
df.loc['b', 'one']

2.0

In [415]:
df.loc['a':'b', 'one']

a    1.0
b    2.0
Name: one, dtype: float64

In [416]:
df.loc['a':'b', :]

   one  two
a  1.0    4
b  2.0    5

In [417]:
df.loc[:, 'one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [418]:
df['three'] = df['one'] * df['two']
df['flag'] = df['two'] > 2
df

   one  two  three  flag
a  1.0    4    4.0  True
b  2.0    5   10.0  True
c  3.0    6   18.0  True
d  NaN    7    NaN  True

Удалять столбцы

In [419]:
# del df['two']
df['foo'] = 0
df
# df.drop(['foo'], axis=1)
df

   one  two  three  flag  foo
a  1.0    4    4.0  True    0
b  2.0    5   10.0  True    0
c  3.0    6   18.0  True    0
d  NaN    7    NaN  True    0

Функции для сортировки

In [420]:
mask = df.apply(lambda x: x['one'] < 1.5 or x['two'] > 2.5, axis=1)
mask

a    True
b    True
c    True
d    True
dtype: bool

In [427]:
df[mask]
df2 = df.copy()

   one  two  three  flag  foo
a  1.0    4    4.0  True    0
b  2.0    5   10.0  True    0
c  3.0    6   18.0  True    0
d  NaN    7    NaN  True    0

Сложение датафреймов возможно даже если у них разные длинны, пустые ячейки заполняться NaN

In [429]:
df3 = pd.concat([df, df2], axis=0)
df3

   one  two  three  flag  foo
a  1.0    4    4.0  True    0
b  2.0    5   10.0  True    0
c  3.0    6   18.0  True    0
d  NaN    7    NaN  True    0
a  1.0    4    4.0  True    0
b  2.0    5   10.0  True    0
c  3.0    6   18.0  True    0
d  NaN    7    NaN  True    0